package variable;

public class Var5 {
    public static void main(String[] args) {
        /* 변수 이름 짓는 규칙
        - 변수 이름은 숫자로 시작할 수 없다. 숫자를 포함하는 것은 가능
        - 공백이 들어갈 수 없다. CamelCase 공백이후등장하는 단어 대문자
        - 예약어를 사용할 수 없다.
        - 변수 이름에는 영문자, 숫자, $, _ 사용
         */

        /* 변수 명명 관계
        - 자바에서 클래스의 이름의 첫글자는 대문자로 시작한다
        - 클래스를 제외한 나머지는 모두 첫글자를 소문자로 시작
        - 예외
            - 상수는 모두 대문자를 사용하고 언더바로 구분
              -> 절대 변하지 않는 값 : USER_LIMIT, PI
            - 패키지 이름은 모두 소문자 사용
         */
        
        /*
        - 변수 이름은 의미를 명확하게
        - 용도를 설명할 수 있어야
         */
    }
}
