package jdbc.ex;

public class Ex7 {
    /*
    [연습문제3]
    앞선 문제에서 만든 결과물에 다음과 같은 조건에 맞는 프로그램으로 수정해보세요.

    [실행내용]
    1. 로그인한 상태에서 메인 메뉴의 '1.Create'를 선택했을 때 나오는 [새 게시물 입력] 중에서 작성자는 제거하는 대신 로그인한 사용자 아이디를 작성자로 사용한다.

    2. 로그인하지 않은 상태에서 메인 메뉴의 '2. Read'를 선택하고, 게시물을 읽었다면 다음과 같은 보조 메뉴를 출력하지 않고 바로 목록으로 되돌아간다. 로그인한 상태에서도 로그인한 사용자 아이디와 작성자가 동일할 경우에만 보조 메뉴가 출력되도록 한다.

    ```
    보조메뉴: 1.Update | 2.Delete | 3.List
    메뉴선택:
    ```

    3. 보조 메뉴의 '1.Update'를 선택했을 때 나오는 [수정 내용 입력] 중에서 작성자는 제거해서 수정할 수 없도록 한다.
     */
}
